import style from "./contract.module.css"
import { Aside } from "../main/content/content-aside/content-aside";
import { Header } from "../header/header";
import { Footer } from "../footer/footer";


export function Contract() {

    return (
        <>
            <Header />
            <div className={style.container}>
                <Aside />
                <div className={style.colum}>
                    <span className={style.colum__title}>Договор оферты</span>
                    <span className={style.colum__subtitle}>
                        1. Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет
                        собой интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
                    </span>
                    <span className={style.colum__text}>
                        1.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
                        участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
                    </span>
                    <span className={style.colum__text}>
                        1.2. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную
                        роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь добавляют
                        фракционных разногласий и преданы социально-демократической анафеме.
                    </span>
                    <span className={style.colum__text}>
                        1.3. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
                        экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
                    </span>
                    <span className={style.colum__text}>
                        1.4. Но независимые государства, которые представляют собой яркий пример континентально-европейского
                        типа политической культуры, будут объединены в целые кластеры себе подобных.
                    </span>
                    <span className={style.colum__subtitle}>
                        2. С учётом сложившейся международной обстановки, консультация с широким активом предоставляет
                        широкие возможности для приоритизации разума над эмоциями.
                    </span>
                    <span className={style.colum__text}>
                        2.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого участника
                        как способного принимать собственные решения касаемо инновационных методов управления процессами.
                    </span>
                    <span className={style.colum__subText}>
                        2.1.1. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную роль в
                        формировании приоритизации разума над эмоциями.
                        Но некоторые особенности внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.
                    </span>
                    <span className={style.colum__subText}>
                        2.1.2. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую экономическую ситуацию
                        , объявлены нарушающими общечеловеческие нормы этики и морали.
                    </span>
                    <span className={style.colum__text}>
                        2.2. Но независимые государства, которые представляют собой яркий пример континентально-европейского типа политической культуры,
                        будут объединены в целые кластеры себе подобных.
                    </span>
                    <span className={style.colum__subtitle}>
                        3. Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас анализа приоритизации
                        разума над эмоциями.
                    </span>
                    <span className={style.colum__text}>
                        3.1. Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого участника как способного
                        принимать собственные решения касаемо инновационных методов управления процессами.
                    </span>
                    <span className={style.colum__subText}>
                        3.1.1. Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное
                        мышление играет важную роль в формировании приоритизации разума над эмоциями.
                        Но некоторые особенности внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.
                    </span>
                    <span className={style.colum__subText}>
                        3.1.2. Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую экономическую ситуацию,
                        объявлены нарушающими общечеловеческие нормы этики и морали.
                    </span>
                    <span className={style.colum__text}>
                        3.2. Но независимые государства, которые представляют собой яркий пример континентально-европейского типа политической культуры,
                        будут объединены в целые кластеры себе подобных.
                    </span>
                    <span className={style.colum__text}>
                        3.3. Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа существующих паттернов поведения.
                    </span>
                    <span className={style.colum__subText}>
                        3.3.1. А ещё представители современных социальных резервов набирают популярность среди определенных слоев населения,
                        а значит, должны быть функционально разнесены на независимые элементы.
                    </span>
                    <span className={style.colum__verySubText}>
                        3.3.1.1. Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены нарушающими общечеловеческие нормы этики и морали.
                    </span>
                    <span className={style.colum__verySubText}>
                        3.3.1.2. Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно фиксирует необходимость новых предложений. Являясь
                        всего лишь частью общей картины, независимые государства представлены в исключительно положительном свете.
                    </span>
                    <span className={style.colum__text}>
                        3.4. Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа распределения внутренних резервов и ресурсов.
                    </span>
                </div>
            </div>
            <Footer />
        </>
    )
}